package maphelper

import "fmt"

func MapCreateOper() {
	var dic map[string]int
	dic = make(map[string]int, 10)
	dic["姓名"] = 006
	dic["年龄"] = 19
	fmt.Println("case 1:", dic)
	fmt.Println("\n ===============================================================================================================================================================================")

	dic2 := make(map[int]string)
	dic2[1] = "张三"
	dic2[2] = "李四"
	fmt.Println("case 2:", dic2)
	fmt.Println("\n ===============================================================================================================================================================================")

	dic3 := map[bool]int{
		true:  1,
		false: 0,
	}

	fmt.Println("case 3:", dic3)
	fmt.Println("\n ===============================================================================================================================================================================")
}

func MapOper() {

	var dic map[string]int
	dic = make(map[string]int, 10)
	dic["姓名"] = 006
	dic["年龄"] = 19
	fmt.Println("年龄是:", dic["年龄"])
	dic["年龄"] = 29
	fmt.Println("修改后的年龄是:", dic["年龄"])

	fmt.Println("case 1:", dic)
	delete(dic, "姓名")
	fmt.Println("删除一个姓名:", dic)

	fmt.Println("\n ===============================================================================================================================================================================")

}

func MapPlusOper() {

	dic := make(map[string]map[int]string)

	dic["班级1"] = make(map[int]string)
	dic["班级1"][1] = "张三"
	dic["班级1"][2] = "李四"
	dic["班级1"][3] = "王五"
	fmt.Println("元素:", dic)

	fmt.Println("\n ===============================================================================================================================================================================")

}
